# Задача controls

Откройте файл `controls.py`. В этом файле для вас уже написаны заготовки функций, которые вам предстоит реализовать.

Каждая функция принимает какие-то аргументы, на основе которых вы должны посчитать ответ на соответствующее задание.
Если ответ на задачу равен `x`, вернуть из функции его можно оператором `return x`. Тем не менее, для преждевременного
выхода из цикла старайтесь использовать операторы `break` или `continue`, а не `return`, завершающий все исполнение
функции.

**Совет**: чтобы тестировать свои реализации, воспользуйтесь блоком `__main__` внизу файла. При запуске `controls.py` на
исполнение будет выполнено все, что находится в этом блоке.

### `def transpose(a)`

Дана матрица (двумерный массив) `a`, то есть каждый элемент `a` &ndash это массив фиксированной длины. Верните
транспонированную матрицу, то есть такую матрицу `aT`, что для всех `i` и `j` верно `aT[i][j] = a[j][i]`.

Считайте, что переданная матрица имеет размер хотя бы 1 по каждому измерению.

### `def read_lines(input, print)`

Пользуясь функцией `input()` как стандартной функцией ввода, считывайте строки из ввода, пока не будет введена пустая
строка. После этого выведите функцией `print()` количество считанных строк.

### `def min_prime(n)`

Найдите минимальный простой делитель целого положительного числа `n`. Например, если `n` четно, верните 2, а если
нечетно и делится на 3 &ndash; верните 3, и так далее.

Считайте, что `n`, передаваемое в качестве параметра, всегда больше 1.

### `def from_hexadecimal(s)`

Дано строковое представление `s` некоторого числа в 16-ричной системе числения, записанное цифрами от '0' до '9' со
своими значениями и буквами от 'A' до 'F' со значениями 10..15. Переведите заданное число в десятичную систему
счисления (требуется получить именно число, не строку).

Разумеется, запрещается использовать встроенную функцию перевода между системами.